In [4]:
#Instalar Panda 
import pandas as pd

In [5]:
df = pd.read_csv('DataScience_salaries_2025.csv')

In [7]:
#Información de los datos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93597 entries, 0 to 93596
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           93597 non-null  int64
 1   experience_level    93597 non-null  object
 2   employment_type     93597 non-null  object
 3   job_title           93597 non-null  object
 4   salary              93597 non-null  int64
 5   salary_currency     93597 non-null  object
 6   salary_in_usd       93597 non-null  int64
 7   employee_residence  93597 non-null  object
 8   remote_ratio        93597 non-null  int64
 9   company_location    93597 non-null  object
 10  company_size        93597 non-null  object
dtypes: int64(4), object(7)
memory usage: 7.9+ MB

In [11]:
#Ver opciones de año
df['work_year'].unique()

array([2025, 2024, 2022, 2023, 2020, 2021])

In [12]:
df2021 = df[df['work_year'] == 2021]
#Ver opciones de año

In [16]:
df2021.info()

<class 'pandas.core.frame.DataFrame'>
Index: 218 entries, 88296 to 93596
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           218 non-null    int64
 1   experience_level    218 non-null    object
 2   employment_type     218 non-null    object
 3   job_title           218 non-null    object
 4   salary              218 non-null    int64
 5   salary_currency     218 non-null    object
 6   salary_in_usd       218 non-null    int64
 7   employee_residence  218 non-null    object
 8   remote_ratio        218 non-null    int64
 9   company_location    218 non-null    object
 10  company_size        218 non-null    object
dtypes: int64(4), object(7)
memory usage: 20.4+ KB

In [17]:
df["experience_level"].unique()

array(['MI', 'SE', 'EN', 'EX'], dtype=object)

In [18]:
df2021.duplicated().sum()
#Eliminar duplicados

np.int64(4)

In [21]:
#Commo ver los duplicados
df2021[df2021.duplicated(keep=False)]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
90666,2021,MI,FT,Data Scientist,150000,USD,150000,US,100,US,M
93359,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
93385,2021,MI,FT,Data Scientist,150000,USD,150000,US,100,US,M
93439,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
93444,2021,EN,FT,Data Scientist,90000,USD,90000,US,100,US,S
93515,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L
93519,2021,EN,FT,Data Scientist,90000,USD,90000,US,100,US,S
93553,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L

In [23]:
df2021['salary_in_usd'].describe()

count       218.000000
mean      99922.073394
std       67072.030451
min       15000.000000
25%       54094.000000
50%       83872.000000
75%      138750.000000
max      423000.000000
Name: salary_in_usd, dtype: float64

In [24]:
df2021['employment_type'].unique()

array(['FT', 'PT', 'FL', 'CT'], dtype=object)

In [27]:
df['job_title'].unique()

array(['Research Scientist', 'AI Engineer', 'Manager',
       'Business Intelligence Developer', 'Software Engineer',
       'Data Scientist', 'Research Engineer', 'Data Specialist',
       'AI Architect', 'Business Analyst', 'Machine Learning Engineer',
       'Data Analyst', 'Data Architect', 'Data Engineer', 'Analyst',
       'Engineer', 'Data Analytics Manager',
       'Business Development Representative', 'Analytics Engineer',
       'Research Associate', 'Product Specialist', 'Systems Engineer',
       'Associate', 'Data Governance', 'Software Development Engineer',
       'Data Governance Lead', 'Software Developer', 'Statistician',
       'Architect', 'Data Product Manager', 'Quantitative Researcher',
       'Product Manager', 'Applied Scientist', 'Cloud Developer',
       'Engineering Manager', 'Consultant', 'Product Designer',
       'Data Operations', 'Statistical Programmer',
       'Data Governance Analyst', 'Solution Architect', 'Data Modeler',
       'Full Stack Developer', 'Data Management Lead',
       'Business Intelligence Analyst', 'Postdoctoral Researcher',
       'DevOps Engineer', 'Solutions Architect', 'Developer',
       'Cloud Engineer', 'MLOps Engineer', 'Solutions Engineer',
       'Data Lead', 'Data Manager', 'Data Management Specialist',
       'Site Reliability Engineer', 'Data Integration Engineer',
       'Director of Machine Learning', 'Data Reporting Analyst',
       'Research Assistant', 'Application Developer', 'BI Engineer',
       'Data Analytics Lead', 'Data Governance Specialist',
       'Insight Analyst', 'Platform Engineer',
       'Business Intelligence Engineer', 'Executive',
       'Machine Learning Scientist', 'Head of Data',
       'Computer Vision Engineer', 'BI Analyst', 'Postdoctoral Fellow',
       'Python Developer', 'Backend Engineer', 'Full Stack Engineer',
       'Data Management Analyst', 'AI Developer', 'Data Developer',
       'Quantitative Analyst', 'Data Integrity Analyst', 'Product Owner',
       'Product Analyst', 'Data Integrator', 'Data Governance Manager',
       'Machine Learning Researcher', 'Analytics Lead',
       'Member of Technical Staff', 'System Engineer',
       'Enterprise Account Executive',
       'Encounter Data Management Professional',
       'Data Visualization Analyst', 'Data Management Consultant',
       'Research Analyst', 'Technical Lead', 'QA Engineer',
       'Lead Data Analysis', 'Data Management Associate', 'Head of AI',
       'Data Infrastructure Engineer', 'Principal Researcher',
       'Computational Scientist', 'BI Developer',
       'Data Visualization Specialist', 'Data Quality Analyst',
       'Data Quality Lead', 'Data Operations Engineer',
       'Software Architect', 'Data Platform Engineer', 'AI Scientist',
       'Data Product Owner', 'Data Visualization Expert',
       'Data Integrity Specialist', 'Power BI Expert',
       'Machine Learning Architect', 'Data and Reporting Professional',
       'Decision Scientist', 'Bioinformatics Scientist', 'Lead Engineer',
       'Data and Reporting Analyst', 'Developer Advocate',
       'Data Strategist', 'Power BI', 'Account Executive',
       'Data Operations Lead', 'Data Visualization Engineer',
       'Data Operations Analyst', 'AI Researcher', 'AI Data Scientist',
       'Robotics Engineer', 'Stage', 'Copywriter',
       'Data Integration Specialist', 'Customer Success Manager',
       'Computational Biologist', 'Actuarial Analyst', 'Data Reporter',
       'Database Administrator', 'Quantitative Developer',
       'Bioinformatician', 'Prompt Engineer', 'Analytics Specialist',
       'AI Governance Lead', 'DataOps Engineer', 'Tableau Developer',
       'Business Intelligence', 'Data Quality Specialist',
       'Cloud Database Engineer', 'AI Data Engineer', 'ETL Developer',
       'Technology Integrator', 'Algorithm Developer', 'AI Specialist',
       'Business Intelligence Specialist', 'Java Developer',
       'Power BI Developer', 'AI Product Owner',
       'Principal Software Architect', 'Data Operations Specialist',
       'Master Data Management', 'Data Analytics Specialist',
       'Security Researcher', 'AI Research Scientist',
       'Principal Statistical Programmer', 'Data Team Lead',
       'Big Data Developer', 'Tech Lead', 'Scala Spark Developer',
       'Sales Development Representative', 'Staff Data Scientist',
       'Cloud Database Administrator', 'AI Machine Learning Engineer',
       'Power BI Specialist', 'GenAI Architect', 'Lead Analyst',
       'Head of Machine Learning', 'Data Analytics Consultant',
       'Data Visualization Developer', 'Machine Learning Developer',
       'Data Strategy Lead', 'Data Scientist Associate',
       'Business Intelligence Manager', 'Risk Analyst',
       'Marketing Science Partner', 'Data Reporting Specialist',
       'Clinical Data Operator', 'AI Lead', 'Machine Learning Specialist',
       'Research Data Manager', 'Technical Specialist',
       'Applied Research Scientist', 'Lead Data Management',
       'Data Analytics Developer', 'Machine Learning Lead',
       'Technical Writer', 'Data Quality Engineer',
       'Data Integration Analyst', 'Safety Data Management Specialist',
       'Business Intelligence Lead', 'Data Operations Manager',
       'Big Data Analyst', 'Data Scientist Manager', 'Pricing Analyst',
       'Lead Data Engineer', 'AI Engineering Manager',
       'Backend Developer', 'Data Management Coordinator',
       'Analytics Analyst', 'Controls Engineer',
       'Machine Learning Tech Lead', 'Business Development Manager',
       'Business Insights Manager', 'Power BI Administrator',
       'Data Integration Developer', 'Platform Data Engineer',
       'Bear Robotics', 'Principal Application Delivery Consultant',
       'Chatbot Developer', 'Artificial Intelligence Engineer',
       'Data Governance Architect', 'Power BI Consultant',
       'Backend Software Engineer', 'AI Product Manager',
       'Data Operations Associate', 'ML Infrastructure Engineer',
       'Fullstack Engineer', 'Machine Learning Quality Engineer',
       'Security Engineer', 'Databricks Engineer',
       'Infrastructure Engineer', 'Solution Engineer',
       'Big Data Engineer', 'Machine Learning Performance Engineer',
       'Data Analytics Associate', 'Power BI Architect',
       'Machine Learning Platform Engineer', 'AI Solution Architect',
       'Data Scientist Lead', 'Machine Vision Engineer',
       'Data Governance Engineer', 'Machine Learning Model Engineer',
       'Marketing Analyst', 'Data Management Manager',
       'Marketing Analytics Manager', 'Applied AI ML Lead',
       'Data Strategy Manager', 'Machine Learning Manager',
       'Data Product Analyst', 'Data Quality Manager',
       'Elasticsearch Administrator',
       'Machine Learning Infrastructure Engineer', 'People Data Analyst',
       'Frontend Engineer', 'NLP Engineer', 'SAS Developer',
       'Data Analytics Team Lead', 'Machine Learning Modeler',
       'Data Integration Coordinator', 'AI Programmer',
       'Admin & Data Analyst', 'Head of Business Intelligence',
       'ETL Engineer', 'AI Research Engineer',
       'Business Intelligence Consultant', 'Robotics Software Engineer',
       'AI Software Engineer', 'Lead AI Engineer',
       'AI Software Development Engineer', 'Master Data Specialist',
       'Consultant Data Engineer', 'Manager Data Management',
       'Director of Business Intelligence', 'Lead Data Scientist',
       'CRM Data Analyst', 'BI Data Analyst', 'Applied Data Scientist',
       'Data DevOps Engineer', 'Quantitative Research Analyst',
       'Lead Machine Learning Engineer',
       'Machine Learning Research Engineer', 'Data Analyst Lead',
       'Data Pipeline Engineer', 'Lead Data Analyst',
       'Business Data Analyst', 'Marketing Data Scientist',
       'Deep Learning Engineer', 'Financial Data Analyst',
       'Azure Data Engineer', 'Principal Data Scientist',
       'Staff Data Analyst', 'Machine Learning Software Engineer',
       'Applied Machine Learning Scientist',
       'Principal Machine Learning Engineer', 'Principal Data Engineer',
       'Staff Machine Learning Engineer',
       'Business Intelligence Data Analyst', 'Finance Data Analyst',
       'Software Data Engineer', 'Compliance Data Analyst',
       'Cloud Data Engineer', 'Analytics Engineering Manager',
       'AWS Data Architect', 'Product Data Analyst',
       'Autonomous Vehicle Technician', 'Sales Data Analyst',
       'Applied Machine Learning Engineer', 'BI Data Engineer',
       'Deep Learning Researcher', 'Big Data Architect',
       'Computer Vision Software Engineer', 'Marketing Data Engineer',
       'Data Science Tech Lead', 'Marketing Data Analyst',
       'Principal Data Architect', 'Data Analytics Engineer',
       'Cloud Data Architect', 'Principal Data Analyst'], dtype=object)

In [28]:
#Dime cuantas personas hay por cada tipo de rol
df2021['job_title'].value_counts()

job_title
Data Scientist                              61
Data Engineer                               37
Machine Learning Engineer                   22
Data Analyst                                20
Research Scientist                          10
Principal Data Scientist                     5
BI Data Analyst                              4
Big Data Engineer                            4
Data Analytics Engineer                      3
Data Analytics Manager                       3
Data Architect                               3
Machine Learning Scientist                   3
Computer Vision Engineer                     3
Lead Data Engineer                           3
Head of Data                                 3
Computer Vision Software Engineer            3
AI Scientist                                 3
Machine Learning Developer                   3
Cloud Data Engineer                          2
Applied Machine Learning Scientist           2
Business Data Analyst                        2
Applied Data Scientist                       2
Principal Data Engineer                      2
Lead Data Analyst                            2
Big Data Architect                           1
Staff Data Scientist                         1
Machine Learning Infrastructure Engineer     1
Finance Data Analyst                         1
Principal Data Analyst                       1
Staff Machine Learning Engineer              1
Lead Data Scientist                          1
Marketing Data Analyst                       1
Cloud Data Architect                         1
Machine Learning Research Engineer           1
Autonomous Vehicle Technician                1
Marketing Data Engineer                      1
Data Specialist                              1
Name: count, dtype: int64

In [31]:
#Como ver los atributos completos de un rol particular
df2021[df2021['job_title'] == 'Lead Data Analyst'].head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
93405,2021,SE,FT,Lead Data Analyst,170000,USD,170000,US,100,US,L
93577,2021,MI,FT,Lead Data Analyst,1450000,INR,19609,IN,100,IN,L

In [32]:
df2020 = df[df['work_year'] == 2020]

In [34]:
#Dime cuantas personas hay por cada tipo de rol
df2020['job_title'].value_counts()

job_title
Data Scientist                              25
Data Engineer                               13
Data Analyst                                 6
Machine Learning Engineer                    5
Business Data Analyst                        3
Big Data Engineer                            3
Research Scientist                           2
Staff Data Analyst                           2
Lead Data Engineer                           2
Lead Data Scientist                          2
Machine Learning Scientist                   1
Computer Vision Engineer                     1
AI Scientist                                 1
BI Data Analyst                              1
Lead Data Analyst                            1
Azure Data Engineer                          1
Machine Learning Infrastructure Engineer     1
Product Data Analyst                         1
Machine Learning Manager                     1
Sales Data Analyst                           1
Staff Data Scientist                         1
Principal Data Scientist                     1
Name: count, dtype: int64

In [35]:
df['job_title'].value_counts()

job_title
Data Scientist                  13848
Data Engineer                   11323
Software Engineer               10133
Data Analyst                     9081
Machine Learning Engineer        6643
                                ...
Controls Engineer                   1
Marketing Data Scientist            1
Business Development Manager        1
Business Insights Manager           1
Platform Data Engineer              1
Name: count, Length: 317, dtype: int64

In [36]:
df["employee_residence"].value_counts()

employee_residence
US    84290
CA     3415
GB     2662
AU      312
DE      273
      ...
BM        1
AD        1
OM        1
UG        1
JE        1
Name: count, Length: 96, dtype: int64

In [37]:
#Cuantas personas hay por rol y pais
df2021.groupby(['job_title', 'employee_residence']).size().reset_index(name='counts')

                              job_title employee_residence  counts
0                          AI Scientist                 ES       1
1                          AI Scientist                 GH       1
2                          AI Scientist                 IN       1
3                Applied Data Scientist                 GB       2
4    Applied Machine Learning Scientist                 US       1
..                                  ...                ...     ...
103                  Research Scientist                 GB       1
104                  Research Scientist                 JE       1
105                  Research Scientist                 PT       1
106                Staff Data Scientist                 US       1
107     Staff Machine Learning Engineer                 US       1

[108 rows x 3 columns]

In [38]:
#Cuantos Data Scientists hay por pais
df2021[df2021['job_title'] == 'Data Scientist'].groupby(['employee_residence']).size().reset_index(name='counts')

   employee_residence  counts
0                  CA       4
1                  CL       1
2                  DE       9
3                  ES       2
4                  FR       5
5                  GB       2
6                  GR       1
7                  IN       7
8                  IT       1
9                  JP       1
10                 NG       1
11                 RS       1
12                 RU       1
13                 SG       1
14                 TR       1
15                 US      23

In [ ]:
df('').describe()

          work_year        salary  salary_in_usd  remote_ratio
count  93597.000000  9.359700e+04   93597.000000  93597.000000
mean    2024.086434  1.623541e+05  157547.696774     21.455816
std        0.641449  2.221425e+05   73649.113729     40.954704
min     2020.000000  1.400000e+04   15000.000000      0.000000
25%     2024.000000  1.062600e+05  106250.000000      0.000000
50%     2024.000000  1.470000e+05  146232.000000      0.000000
75%     2024.000000  1.990000e+05  198000.000000      0.000000
max     2025.000000  3.040000e+07  800000.000000    100.000000